app/views/cityzones/_form.html.erb

SELECT "cities".* FROM "cities"
---
    <%= f.label :Select_city%><br>
    <%= f.collection_select :city_id, City.all, :id, :city, {prompt: "City"} %>