app/views/projects/_form.html.erb

SELECT "builders".* FROM "builders"
---
    <%= f.label :Select_builder %><br>
    <%= f.collection_select :builder_id, Builder.all, :id, :name, {prompt: "Choose Builder"} %>

SELECT "states".* FROM "states"
---
   <%= f.label :Select_state%><br>
    <%= f.collection_select :state_id, State.all, :id, :state, {prompt: "State"} %>

SELECT "cities".* FROM "cities"
---
    <%= f.label :Select_city%><br>
    <%= f.collection_select :city_id, City.all, :id, :city, {prompt: "City"} %>

SELECT "cityzones".* FROM "cityzones"
---
    <%= f.label :Select_cityzone%><br>
    <%= f.collection_select :cityzone_id, Cityzone.all, :id, :cityzone, {prompt: "CityZone"} %>

SELECT "statuses".* FROM "statuses"
---
     <%= f.label :Select_status%><br>
      <%= f.collection_select :status_id, Status.all, :id, :status, {prompt: "Status"} %>

SELECT "categories".* FROM "categories"
---
   <%= f.label :Select_builder %><br>
    <%= f.collection_select :cat_id, Category.all, :id, :category, {prompt: "Choose Category"} %>