app/views/apis/index.html.erb

Builder Name:
 <% @bname=Builder.find_by("id": @b_id)   %>
---
SELECT  "builders".* FROM "builders" WHERE "builders"."name" = ? LIMIT 1  [["name", "1"]]