app/controllers/apis_controller.rb

SELECT "projects".* FROM "projects"
---
  def index

@result=Project.all

SELECT  "apis".* FROM "apis" WHERE "apis"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_api
      @api = Api.find(params[:id])