app/controllers/builders_controller.rb

SELECT "builders".* FROM "builders"
---
  def index
    @builders = Builder.all

INSERT INTO "builders" ("name", "phone", "email", "company", "phone1", "phone2", "email1", "email2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @builder = Builder.new(builder_params)

    respond_to do |format|
      if @builder.save

DELETE FROM "builders" WHERE "builders"."id" = ?  [["id", 1]]
---
  def destroy
    @builder.destroy

SELECT  "builders".* FROM "builders" WHERE "builders"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_builder
      @builder = Builder.find(params[:id])