app/controllers/cityzones_controller.rb

SELECT "cityzones".* FROM "cityzones"
---
  def index
    @cityzones = Cityzone.all

INSERT INTO "cityzones" ("cityzone", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cityzone", "Naupada"], ["city_id", 1], ["created_at", "2015-08-27 10:26:06.093999"], ["updated_at", "2015-08-27 10:26:06.093999"]]
---
  def create
    @cityzone = Cityzone.new(cityzone_params)

    respond_to do |format|
      if @cityzone.save

SELECT  "cityzones".* FROM "cityzones" WHERE "cityzones"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cityzone
      @cityzone = Cityzone.find(params[:id])