app/controllers/location_filter_controller.rb

SELECT  "builders".* FROM "builders" WHERE (ankitesh) LIMIT 1
---
    def index
       @builder = Builder.all