app/controllers/location_filter_controller.rb

    def index
      @builder = Builder.where(name: $search)
---
SELECT  "builders".* FROM "builders" WHERE "builders"."name" = ? LIMIT 1  [["name", "ankitesh"]]