app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("Project_name", "address", "latitude", "longitude", "size", "total_area", "launch_date", "possesion_date", "price", "price_per_sq_feet", "offer", "overview", "builder_id", "state_id", "city_id", "cityzone_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "cat_id", "status_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)