app/controllers/temporaries_controller.rb

SELECT "builders".* FROM "builders" WHERE "builders"."id" IN (NULL)
SELECT "projects".* FROM "projects"
---
  def index
  @proj=Project.includes(:builder).all