app/views/cities/_form.html.erb

SELECT "states".* FROM "states"
---
    <%= f.label :Select_State%><br>
    <%= f.collection_select :state_id, State.all, :id, :state, {prompt: "State"} %>